// Возвращает таблицу значений со счетами, используемыми для учета взаиморсчетов по забалансовой таре
//
// Параметры
//  <ВключатьГруппыСчетов>  	- <Булево> - нужно ли в таблицу включать группы счетов?
//  <РаскрыватьГруппыСчетов>  	- <Булево> - нужно ли в таблицу включать субсчета групп счетов?
//								Если первый параметр установлен в ЛОЖЬ, второй параметр не учитывается (всегда ИСТИНА)
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений с единственной колонкой "СчетУчета"
//
Функция ПолучитьТаблицуСчетовУчетаВзаиморасчетовЗаб(ВключатьГруппыСчетов = Ложь, РаскрыватьГруппыСчетов = Истина) Экспорт

	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МатериальныеЦенностиНаОтветственномХранении);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ИмуществоВДоверительномУправлении);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиДебиторами);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСДругимиКредиторами);

	СписокСчетовИсключить = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокСчетов", 	СписокСчетов);
	Запрос.УстановитьПараметр("СписокСчетовИсключить", СписокСчетовИсключить);
	Запрос.УстановитьПараметр("Контрагенты", 	ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	Запрос.УстановитьПараметр("Номенклатура", 	  	ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	
	Если ВключатьГруппыСчетов=Истина Тогда
		Если РаскрыватьГруппыСчетов=Истина Тогда
			ТекстУсловия = "";	// и группы счетов и субсчета
		Иначе
			ТекстУсловия = "И Хозрасчетный.ЗапретитьИспользоватьВПроводках = Истина"; // только группы счетов
		КонецЕсли;
	Иначе
		ТекстУсловия = "И Хозрасчетный.ЗапретитьИспользоватьВПроводках = Ложь"; // только счета
	КонецЕсли;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК СчетРасчетов
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&СписокСчетов)
	|	И (НЕ Хозрасчетный.Ссылка В (&СписокСчетовИсключить))
	|	И Хозрасчетный.ВидыСубконто.ВидСубконто = &Контрагенты
	|	И Хозрасчетный.ВидыСубконто.ВидСубконто = &Номенклатура
	|	И Хозрасчетный.Забалансовый
	|	" + ТекстУсловия + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Хозрасчетный.Порядок";
						 
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьСчетаВзаиморасчетовПоУмолчанию()
